# -*- coding: utf-8 -*-
"""les2_task1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1I-uqXQbXgmYWm21rvh7V7889DUhvUgrV
"""

#Создать калькулятор
while True:
  x = input("Выберите один из знаков ('+' '-' '*' '/'): ")
  if x == '0': 
      break
  
  if x in ('+', '-', '*', '/', 0):
    a = int(input("Введите первое число: "))
    b = int(input("Введите второе число: "))
    
    if x == '+':
      print(f'Ответ: {a + b}. Если вы закончили в следующем действии нажмите знак 0')
    elif x == '-':
      print(f'Ответ: {a - b}. Если вы закончили в следующем действии нажмите знак 0')
    elif x == '*':
      print(f'Ответ: {a * b}. Если вы закончили в следующем действии нажмите знак 0')  
    elif x == '/':
      if b != 0:
        print(f'Ответ: {round(a / b, 2)}. Если вы закончили в следующем действии нажмите знак 0')
      else:
        print(f'Не делится на 0')
      
  else:
    print('Введите правильный знак')