# -*- coding: utf-8 -*-
"""les2_task4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1I-uqXQbXgmYWm21rvh7V7889DUhvUgrV
"""

#Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,… Количество элементов (n) вводится с клавиатуры
n = int(input("Введите количество суммирований n/-2: "))

multiple = 1
counter = 0
s = 0
while counter < n:
	s += multiple
	multiple = multiple /-2
	counter += 1
 
print(s)